#include <stdio.h>
//import library
#include <stdbool.h>
//boolean ตัวแปรแบบยบูลีน เก็บข้อมูลได้2 ค่า คือ 1 , 0//


void main(){

    //===================== ตัววแปร ===============//

    int num1,num2,a;
    float result;
    bool total[10];

    //===================== ตัววแปร ===============//
    //========================inptut====================//
    //printf("Input num 1 : ");
    //scanf("%d",&num1);
    //printf("Input num 2 : ");
    //scanf("%d",&num2);
//alt cursor //
    //===========================================//
    // ===================การคำนวณ=============//
    //result = num1 % num2;
    //result = 5* 10 / 2 + 6 * 8 + (20 - 15 );
    total[0] = 2 < 1;
    total[1] = 200 <= 201;
    total[2] = 2 == 2;
    total[3] = 2 != 2;
    //เป็นจริงทั้งคู่//
    //==========T=============F====// f=0//
    total[4] = (3 < 5 ) && (6 >= 7);
    //ctrl d //เลือกตัวซ้ำทีละัว
    //ctrl f2 // เลือกตัวซ้ำทั้งหมด//
    //เป็นจริงกรดีใดก็จะเป็นจริง//
    //           จริง           เท้จ     //
    total[5] = (5 <= 20) || ( 6 > 9 );

    a = 5;
    a += 10; // total6 + 10//


    //==========================================//
    //==============output====================//
    printf("total1 : %d \n",total[0]);
    printf("total2 : %d \n",total[1]);
    printf("total3 : %d \n",total[2]);
    printf("total4 : %d \n",total[3]);
    printf("total5 : %d \n",total[4]);
    printf("total6 : %d \n",total[5]);
    printf("total7 : %d \n",a);

    //=========================================//